/*
 * 	변수 / 데이터형
 * 	연산자 / 제어문
 * 	-----------
 * 	배열 / 메소드
 * 	-----------
 * 	문자열 / 문자열 배열
 * 	-----------
 * 	사용자 정의 데이터형 : 클래스
 * 	-----------	+ 기능 => 객체 지향 프로그램
 * 	클래스 == 클래스
 * 			인터페이스
 * 	-----------
 * 	예외처리
 * 	-----------
 * 	기타 기능
 * 		= 어노테이션
 * 		= 열거형
 * 		= 람다식
 * 	-----------  JAVA
 * 	라이브러리
 * 		: 컬렉션
 * 		: IO
 * 		: 네트워크
 * 		: 데이터베이스
 * 	------------	웹에서 자바 응용 / 오라클 연동
 * 
 * 
 * 	1. 형식
 * 		---
 * 			// 리턴형은 모든 데이터형/배열/클래스 사용 가능 : 한 개만 사용 가능
 * 			// 매개변수는 여러개 사용이 가능 (3개 이상이면 배열/클래스 사용이 용이함)
 * 			[접근지정어][제어어] 리턴형 메소드명(매개변수...)
 * 			{
 * 				구현
 * 				return 값; ==> void 는 생략이 가능
 * 			}
 * 			==> 파이썬은 리턴을 여러개 할 수 있다
 * 	2. 제작 여부
 * 		=> 재사용 / 다른 클래스와 연결
 * 		=> 객체지향 프로그램 : 여러개의 클래스를 조합해서 만든다
 * 		=> 분산 (여러명이 동시에 개발이 가능)
 * 			------------------------
 * 			
 * 	3. 응용 => 리턴형 / 매개변수
 * 				리턴: 처리 결과값
 * 				매개변수: 사용자가 보내주는 값
 * 	4. 호출	=> 메소드명(값, 값...)
 * 	------------- 메소드 : 긴 소스를 나눠주는 역할
 * 	5. 호출되면 무조건 메소드 처음부터 수행함
 * 
 */
public class 메소드_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
